GopalSaraf/Practicals/PSDL/include/proc/pic16f18325.inc
// Register: TOSL
#define TOSL TOSL
TOSL                                     equ 0FEEh
// bitfield definitions
TOSL_TOSL_POSN                           equ 0000h
TOSL_TOSL_POSITION                       equ 0000h
TOSL_TOSL_SIZE                           equ 0008h
TOSL_TOSL_LENGTH                         equ 0008h
TOSL_TOSL_MASK                           equ 00FFh

// Register: TOSH
#define TOSH TOSH
TOSH                                     equ 0FEFh
// bitfield definitions
TOSH_TOSH_POSN                           equ 0000h
TOSH_TOSH_POSITION                       equ 0000h
TOSH_TOSH_SIZE                           equ 0007h
TOSH_TOSH_LENGTH                         equ 0007h
TOSH_TOSH_MASK                           equ 007Fh

/*
 * Bit Access Macros
 */

#ifndef PAGEMASK
#define PAGEMASK(addr) ((addr) and 07FFh)
#endif
#ifndef BANKMASK
#define BANKMASK(addr) ((addr) and 07Fh)
#endif
#define ABDEN                            BANKMASK(BAUD1CON), 0
#define ABDOVF                           BANKMASK(BAUD1CON), 7
#define ADACT0                           BANKMASK(ADACT), 0
#define ADACT1                           BANKMASK(ADACT), 1
#define ADACT2                           BANKMASK(ADACT), 2
#define ADACT3                           BANKMASK(ADACT), 3
#define ADACT4                           BANKMASK(ADACT), 4
#define ADCMD                            BANKMASK(PMD2), 5
#define ADCS0                            BANKMASK(ADCON1), 4
#define ADCS1                            BANKMASK(ADCON1), 5
#define ADCS2                            BANKMASK(ADCON1), 6
#define ADDEN                            BANKMASK(RC1STA), 3
#define ADFM                             BANKMASK(ADCON1), 7
#define ADFVR0                           BANKMASK(FVRCON), 0
#define ADFVR1                           BANKMASK(FVRCON), 1
#define ADGO                             BANKMASK(ADCON0), 1
#define ADIE                             BANKMASK(PIE1), 6
#define ADIF                             BANKMASK(PIR1), 6
#define ADNREF                           BANKMASK(ADCON1), 2
#define ADOEN                            BANKMASK(OSCEN), 2
#define ADON                             BANKMASK(ADCON0), 0
#define ADOR                             BANKMASK(OSCSTAT1), 2
#define ADPREF0                          BANKMASK(ADCON1), 0
#define ADPREF1                          BANKMASK(ADCON1), 1
#define ANSA0                            BANKMASK(ANSELA), 0
#define ANSA1                            BANKMASK(ANSELA), 1
#define ANSA2                            BANKMASK(ANSELA), 2
#define ANSA4                            BANKMASK(ANSELA), 4
#define ANSA5                            BANKMASK(ANSELA), 5
#define ANSC0                            BANKMASK(ANSELC), 0
#define ANSC1                            BANKMASK(ANSELC), 1
#define ANSC2                            BANKMASK(ANSELC), 2
#define ANSC3                            BANKMASK(ANSELC), 3
#define ANSC4                            BANKMASK(ANSELC), 4
#define ANSC5                            BANKMASK(ANSELC), 5
#define BCL1IE                           BANKMASK(PIE1), 2
#define BCL1IF                           BANKMASK(PIR1), 2
#define BCL2IE                           BANKMASK(PIE2), 2
#define BCL2IF                           BANKMASK(PIR2), 2
#define BORRDY                           BANKMASK(BORCON), 0
#define BRG16                            BANKMASK(BAUD1CON), 3
#define BRGH                             BANKMASK(TX1STA), 2
#define BSR0                             BANKMASK(BSR), 0
#define BSR1                             BANKMASK(BSR), 1
#define BSR2                             BANKMASK(BSR), 2
#define BSR3                             BANKMASK(BSR), 3
#define BSR4                             BANKMASK(BSR), 4
#define C1HYS                            BANKMASK(CM1CON0), 1
#define C1IE                             BANKMASK(PIE2), 5
#define C1IF                             BANKMASK(PIR2), 5
#define C1INTN                           BANKMASK(CM1CON1), 6
#define C1INTP                           BANKMASK(CM1CON1), 7
#define C1NCH0                           BANKMASK(CM1CON1), 0
#define C1NCH1                           BANKMASK(CM1CON1), 1
#define C1NCH2                           BANKMASK(CM1CON1), 2
#define C1ON                             BANKMASK(CM1CON0), 7
#define C1OUT                            BANKMASK(CM1CON0), 6
#define C1PCH0                           BANKMASK(CM1CON1), 3
#define C1PCH1                           BANKMASK(CM1CON1), 4
#define C1PCH2                           BANKMASK(CM1CON1), 5
#define C1POL                            BANKMASK(CM1CON0), 4
#define C1SP                             BANKMASK(CM1CON0), 2
#define C1SYNC                           BANKMASK(CM1CON0), 0
#define C1TSEL0                          BANKMASK(CCPTMRS), 0
#define C1TSEL1                          BANKMASK(CCPTMRS), 1
#define C2HYS                            BANKMASK(CM2CON0), 1
#define C2IE                             BANKMASK(PIE2), 6
#define C2IF                             BANKMASK(PIR2), 6
#define C2INTN                           BANKMASK(CM2CON1), 6
#define C2INTP                           BANKMASK(CM2CON1), 7
#define C2NCH0                           BANKMASK(CM2CON1), 0
#define C2NCH1                           BANKMASK(CM2CON1), 1
#define C2NCH2                           BANKMASK(CM2CON1), 2
#define C2ON                             BANKMASK(CM2CON0), 7
#define C2OUT                            BANKMASK(CM2CON0), 6
#define C2PCH0                           BANKMASK(CM2CON1), 3
#define C2PCH1                           BANKMASK(CM2CON1), 4
#define C2PCH2                           BANKMASK(CM2CON1), 5
#define C2POL                            BANKMASK(CM2CON0), 4
#define C2SP                             BANKMASK(CM2CON0), 2
#define C2SYNC                           BANKMASK(CM2CON0), 0
#define C2TSEL0                          BANKMASK(CCPTMRS), 2
#define C2TSEL1                          BANKMASK(CCPTMRS), 3
#define C3TSEL0                          BANKMASK(CCPTMRS), 4
#define C3TSEL1                          BANKMASK(CCPTMRS), 5
#define C4TSEL0                          BANKMASK(CCPTMRS), 6
#define C4TSEL1                          BANKMASK(CCPTMRS), 7
#define CARRY                            BANKMASK(STATUS), 0
#define CCDEN                            BANKMASK(CCDCON), 7
#define CCDS0                            BANKMASK(CCDCON), 0
#define CCDS1                            BANKMASK(CCDCON), 1
#define CCP1CTS0                         BANKMASK(CCP1CAP), 0
#define CCP1CTS1                         BANKMASK(CCP1CAP), 1
#define CCP1CTS2                         BANKMASK(CCP1CAP), 2
#define CCP1CTS3                         BANKMASK(CCP1CAP), 3
#define CCP1EN                           BANKMASK(CCP1CON), 7
#define CCP1FMT                          BANKMASK(CCP1CON), 4
#define CCP1IE                           BANKMASK(PIE4), 0
#define CCP1IF                           BANKMASK(PIR4), 0
#define CCP1MD                           BANKMASK(PMD3), 0
#define CCP1MODE0                        BANKMASK(CCP1CON), 0
#define CCP1MODE1                        BANKMASK(CCP1CON), 1
#define CCP1MODE2                        BANKMASK(CCP1CON), 2
#define CCP1MODE3                        BANKMASK(CCP1CON), 3
#define CCP1OUT                          BANKMASK(CCP1CON), 5
#define CCP1PPS0                         BANKMASK(CCP1PPS), 0
#define CCP1PPS1                         BANKMASK(CCP1PPS), 1
#define CCP1PPS2                         BANKMASK(CCP1PPS), 2
#define CCP1PPS3                         BANKMASK(CCP1PPS), 3
#define CCP1PPS4                         BANKMASK(CCP1PPS), 4
#define CCP2CTS0                         BANKMASK(CCP2CAP), 0
#define CCP2CTS1                         BANKMASK(CCP2CAP), 1
#define CCP2CTS2                         BANKMASK(CCP2CAP), 2
#define CCP2CTS3                         BANKMASK(CCP2CAP), 3
#define CCP2EN                           BANKMASK(CCP2CON), 7
#define CCP2FMT                          BANKMASK(CCP2CON), 4
#define CCP2IE                           BANKMASK(PIE4), 1
#define CCP2IF                           BANKMASK(PIR4), 1
#define CCP2MD                           BANKMASK(PMD3), 1
#define CCP2MODE0                        BANKMASK(CCP2CON), 0
#define CCP2MODE1                        BANKMASK(CCP2CON), 1
#define CCP2MODE2                        BANKMASK(CCP2CON), 2
#define CCP2MODE3                        BANKMASK(CCP2CON), 3
#define CCP2OUT                          BANKMASK(CCP2CON), 5
#define CCP2PPS0                         BANKMASK(CCP2PPS), 0
#define CCP2PPS1                         BANKMASK(CCP2PPS), 1
#define CCP2PPS2                         BANKMASK(CCP2PPS), 2
#define CCP2PPS3                         BANKMASK(CCP2PPS), 3
#define CCP2PPS4                         BANKMASK(CCP2PPS), 4
#define CCP3CTS0                         BANKMASK(CCP3CAP), 0
#define CCP3CTS1                         BANKMASK(CCP3CAP), 1
#define CCP3CTS2                         BANKMASK(CCP3CAP), 2
#define CCP3CTS3                         BANKMASK(CCP3CAP), 3
#define CCP3EN                           BANKMASK(CCP3CON), 7
#define CCP3FMT                          BANKMASK(CCP3CON), 4
#define CCP3IE                           BANKMASK(PIE4), 2
#define CCP3IF                           BANKMASK(PIR4), 2
#define CCP3MD                           BANKMASK(PMD3), 2
#define CCP3MODE0                        BANKMASK(CCP3CON), 0
#define CCP3MODE1                        BANKMASK(CCP3CON), 1
#define CCP3MODE2                        BANKMASK(CCP3CON), 2
#define CCP3MODE3                        BANKMASK(CCP3CON), 3
#define CCP3OUT                          BANKMASK(CCP3CON), 5
#define CCP3PPS0                         BANKMASK(CCP3PPS), 0
#define CCP3PPS1                         BANKMASK(CCP3PPS), 1
#define CCP3PPS2                         BANKMASK(CCP3PPS), 2
#define CCP3PPS3                         BANKMASK(CCP3PPS), 3
#define CCP3PPS4                         BANKMASK(CCP3PPS), 4
#define CCP4CTS0                         BANKMASK(CCP4CAP), 0
#define CCP4CTS1                         BANKMASK(CCP4CAP), 1
#define CCP4CTS2                         BANKMASK(CCP4CAP), 2
#define CCP4CTS3                         BANKMASK(CCP4CAP), 3
#define CCP4EN                           BANKMASK(CCP4CON), 7
#define CCP4FMT                          BANKMASK(CCP4CON), 4
#define CCP4IE                           BANKMASK(PIE4), 3
#define CCP4IF                           BANKMASK(PIR4), 3
#define CCP4MD                           BANKMASK(PMD3), 3
#define CCP4MODE0                        BANKMASK(CCP4CON), 0
#define CCP4MODE1                        BANKMASK(CCP4CON), 1
#define CCP4MODE2                        BANKMASK(CCP4CON), 2
#define CCP4MODE3                        BANKMASK(CCP4CON), 3
#define CCP4OUT                          BANKMASK(CCP4CON), 5
#define CCP4PPS0                         BANKMASK(CCP4PPS), 0
#define CCP4PPS1                         BANKMASK(CCP4PPS), 1
#define CCP4PPS2                         BANKMASK(CCP4PPS), 2
#define CCP4PPS3                         BANKMASK(CCP4PPS), 3
#define CCP4PPS4                         BANKMASK(CCP4PPS), 4
#define CDAFVR0                          BANKMASK(FVRCON), 2
#define CDAFVR1                          BANKMASK(FVRCON), 3
#define CDIV0                            BANKMASK(OSCCON2), 0
#define CDIV1                            BANKMASK(OSCCON2), 1
#define CDIV2                            BANKMASK(OSCCON2), 2
#define CDIV3                            BANKMASK(OSCCON2), 3
#define CFGS                             BANKMASK(NVMCON1), 6
#define CHS0                             BANKMASK(ADCON0), 2
#define CHS1                             BANKMASK(ADCON0), 3
#define CHS2                             BANKMASK(ADCON0), 4
#define CHS3                             BANKMASK(ADCON0), 5
#define CHS4                             BANKMASK(ADCON0), 6
#define CHS5                             BANKMASK(ADCON0), 7
#define CLC1IE                           BANKMASK(PIE3), 0
#define CLC1IF                           BANKMASK(PIR3), 0
#define CLC1MD                           BANKMASK(PMD5), 1
#define CLC2IE                           BANKMASK(PIE3), 1
#define CLC2IF                           BANKMASK(PIR3), 1
#define CLC2MD                           BANKMASK(PMD5), 2
#define CLC3IE                           BANKMASK(PIE3), 2
#define CLC3IF                           BANKMASK(PIR3), 2
#define CLC3MD                           BANKMASK(PMD5), 3
#define CLC4IE                           BANKMASK(PIE3), 3
#define CLC4IF                           BANKMASK(PIR3), 3
#define CLC4MD                           BANKMASK(PMD5), 4
#define CLCIN0PPS0                       BANKMASK(CLCIN0PPS), 0
#define CLCIN0PPS1                       BANKMASK(CLCIN0PPS), 1
#define CLCIN0PPS2                       BANKMASK(CLCIN0PPS), 2
#define CLCIN0PPS3                       BANKMASK(CLCIN0PPS), 3
#define CLCIN0PPS4                       BANKMASK(CLCIN0PPS), 4
#define CLCIN1PPS0                       BANKMASK(CLCIN1PPS), 0
#define CLCIN1PPS1                       BANKMASK(CLCIN1PPS), 1
#define CLCIN1PPS2                       BANKMASK(CLCIN1PPS), 2
#define CLCIN1PPS3                       BANKMASK(CLCIN1PPS), 3
#define CLCIN1PPS4                       BANKMASK(CLCIN1PPS), 4
#define CLCIN2PPS0                       BANKMASK(CLCIN2PPS), 0
#define CLCIN2PPS1                       BANKMASK(CLCIN2PPS), 1
#define CLCIN2PPS2                       BANKMASK(CLCIN2PPS), 2
#define CLCIN2PPS3                       BANKMASK(CLCIN2PPS), 3
#define CLCIN2PPS4                       BANKMASK(CLCIN2PPS), 4
#define CLCIN3PPS0                       BANKMASK(CLCIN3PPS), 0
#define CLCIN3PPS1                       BANKMASK(CLCIN3PPS), 1
#define CLCIN3PPS2                       BANKMASK(CLCIN3PPS), 2
#define CLCIN3PPS3                       BANKMASK(CLCIN3PPS), 3
#define CLCIN3PPS4                       BANKMASK(CLCIN3PPS), 4
#define CLKRDC0                          BANKMASK(CLKRCON), 3
#define CLKRDC1                          BANKMASK(CLKRCON), 4
#define CLKRDIV0                         BANKMASK(CLKRCON), 0
#define CLKRDIV1                         BANKMASK(CLKRCON), 1
#define CLKRDIV2                         BANKMASK(CLKRCON), 2
#define CLKREN                           BANKMASK(CLKRCON), 7
#define CLKRMD                           BANKMASK(PMD0), 1
#define CMP1MD                           BANKMASK(PMD2), 1
#define CMP2MD                           BANKMASK(PMD2), 2
#define COSC0                            BANKMASK(OSCCON2), 4
#define COSC1                            BANKMASK(OSCCON2), 5
#define COSC2                            BANKMASK(OSCCON2), 6
#define CREN                             BANKMASK(RC1STA), 4
#define CSRC                             BANKMASK(TX1STA), 7
#define CSWHOLD                          BANKMASK(OSCCON3), 7
#define CSWIE                            BANKMASK(PIE3), 6
#define CSWIF                            BANKMASK(PIR3), 6
#define CWG1CS                           BANKMASK(CWG1CLKCON), 0
#define CWG1DAT0                         BANKMASK(CWG1DAT), 0
#define CWG1DAT1                         BANKMASK(CWG1DAT), 1
#define CWG1DAT2                         BANKMASK(CWG1DAT), 2
#define CWG1DAT3                         BANKMASK(CWG1DAT), 3
#define CWG1DBF0                         BANKMASK(CWG1DBF), 0
#define CWG1DBF1                         BANKMASK(CWG1DBF), 1
#define CWG1DBF2                         BANKMASK(CWG1DBF), 2
#define CWG1DBF3                         BANKMASK(CWG1DBF), 3
#define CWG1DBF4                         BANKMASK(CWG1DBF), 4
#define CWG1DBF5                         BANKMASK(CWG1DBF), 5
#define CWG1DBR0                         BANKMASK(CWG1DBR), 0
#define CWG1DBR1                         BANKMASK(CWG1DBR), 1
#define CWG1DBR2                         BANKMASK(CWG1DBR), 2
#define CWG1DBR3                         BANKMASK(CWG1DBR), 3
#define CWG1DBR4                         BANKMASK(CWG1DBR), 4
#define CWG1DBR5                         BANKMASK(CWG1DBR), 5
#define CWG1EN                           BANKMASK(CWG1CON0), 7
#define CWG1IE                           BANKMASK(PIE4), 6
#define CWG1IF                           BANKMASK(PIR4), 6
#define CWG1IN                           BANKMASK(CWG1CON1), 5
#define CWG1LD                           BANKMASK(CWG1CON0), 6
#define CWG1LSAC0                        BANKMASK(CWG1AS0), 2
#define CWG1LSAC1                        BANKMASK(CWG1AS0), 3
#define CWG1LSBD0                        BANKMASK(CWG1AS0), 4
#define CWG1LSBD1                        BANKMASK(CWG1AS0), 5
#define CWG1MD                           BANKMASK(PMD3), 6
#define CWG1MODE0                        BANKMASK(CWG1CON0), 0
#define CWG1MODE1                        BANKMASK(CWG1CON0), 1
#define CWG1MODE2                        BANKMASK(CWG1CON0), 2
#define CWG1OVRA                         BANKMASK(CWG1STR), 4
#define CWG1OVRB                         BANKMASK(CWG1STR), 5
#define CWG1OVRC                         BANKMASK(CWG1STR), 6
#define CWG1OVRD                         BANKMASK(CWG1STR), 7
#define CWG1POLA                         BANKMASK(CWG1CON1), 0
#define CWG1POLB                         BANKMASK(CWG1CON1), 1
#define CWG1POLC                         BANKMASK(CWG1CON1), 2
#define CWG1POLD                         BANKMASK(CWG1CON1), 3
#define CWG1PPS0                         BANKMASK(CWG1PPS), 0
#define CWG1PPS1                         BANKMASK(CWG1PPS), 1
#define CWG1PPS2                         BANKMASK(CWG1PPS), 2
#define CWG1PPS3                         BANKMASK(CWG1PPS), 3
#define CWG1PPS4                         BANKMASK(CWG1PPS), 4
#define CWG1REN                          BANKMASK(CWG1AS0), 6
#define CWG1SHUTDOWN                     BANKMASK(CWG1AS0), 7
#define CWG1STRA                         BANKMASK(CWG1STR), 0
#define CWG1STRB                         BANKMASK(CWG1STR), 1
#define CWG1STRC                         BANKMASK(CWG1STR), 2
#define CWG1STRD                         BANKMASK(CWG1STR), 3
#define CWG2CS                           BANKMASK(CWG2CLKCON), 0
#define CWG2DAT0                         BANKMASK(CWG2DAT), 0
#define CWG2DAT1                         BANKMASK(CWG2DAT), 1
#define CWG2DAT2                         BANKMASK(CWG2DAT), 2
#define CWG2DAT3                         BANKMASK(CWG2DAT), 3
#define CWG2DBF0                         BANKMASK(CWG2DBF), 0
#define CWG2DBF1                         BANKMASK(CWG2DBF), 1
#define CWG2DBF2                         BANKMASK(CWG2DBF), 2
#define CWG2DBF3                         BANKMASK(CWG2DBF), 3
#define CWG2DBF4                         BANKMASK(CWG2DBF), 4
#define CWG2DBF5                         BANKMASK(CWG2DBF), 5
#define CWG2DBR0                         BANKMASK(CWG2DBR), 0
#define CWG2DBR1                         BANKMASK(CWG2DBR), 1
#define CWG2DBR2                         BANKMASK(CWG2DBR), 2
#define CWG2DBR3                         BANKMASK(CWG2DBR), 3
#define CWG2DBR4                         BANKMASK(CWG2DBR), 4
#define CWG2DBR5                         BANKMASK(CWG2DBR), 5
#define CWG2EN                           BANKMASK(CWG2CON0), 7
#define CWG2IE                           BANKMASK(PIE4), 7
#define CWG2IF                           BANKMASK(PIR4), 7
#define CWG2IN                           BANKMASK(CWG2CON1), 5
#define CWG2LD                           BANKMASK(CWG2CON0), 6
#define CWG2LSAC0                        BANKMASK(CWG2AS0), 2
#define CWG2LSAC1                        BANKMASK(CWG2AS0), 3
#define CWG2LSBD0                        BANKMASK(CWG2AS0), 4
#define CWG2LSBD1                        BANKMASK(CWG2AS0), 5
#define CWG2MD                           BANKMASK(PMD3), 7
#define CWG2MODE0                        BANKMASK(CWG2CON0), 0
#define CWG2MODE1                        BANKMASK(CWG2CON0), 1
#define CWG2MODE2                        BANKMASK(CWG2CON0), 2
#define CWG2OVRA                         BANKMASK(CWG2STR), 4
#define CWG2OVRB                         BANKMASK(CWG2STR), 5
#define CWG2OVRC                         BANKMASK(CWG2STR), 6
#define CWG2OVRD                         BANKMASK(CWG2STR), 7
#define CWG2POLA                         BANKMASK(CWG2CON1), 0
#define CWG2POLB                         BANKMASK(CWG2CON1), 1
#define CWG2POLC                         BANKMASK(CWG2CON1), 2
#define CWG2POLD                         BANKMASK(CWG2CON1), 3
#define CWG2PPS0                         BANKMASK(CWG2PPS), 0
#define CWG2PPS1                         BANKMASK(CWG2PPS), 1
#define CWG2PPS2                         BANKMASK(CWG2PPS), 2
#define CWG2PPS3                         BANKMASK(CWG2PPS), 3
#define CWG2PPS4                         BANKMASK(CWG2PPS), 4
#define CWG2REN                          BANKMASK(CWG2AS0), 6
#define CWG2SHUTDOWN                     BANKMASK(CWG2AS0), 7
#define CWG2STRA                         BANKMASK(CWG2STR), 0
#define CWG2STRB                         BANKMASK(CWG2STR), 1
#define CWG2STRC                         BANKMASK(CWG2STR), 2
#define CWG2STRD                         BANKMASK(CWG2STR), 3
#define C_SHAD                           BANKMASK(STATUS_SHAD), 0
#define DAC1EN                           BANKMASK(DACCON0), 7
#define DAC1NSS                          BANKMASK(DACCON0), 0
#define DAC1OE                           BANKMASK(DACCON0), 5
#define DAC1PSS0                         BANKMASK(DACCON0), 2
#define DAC1PSS1                         BANKMASK(DACCON0), 3
#define DAC1R0                           BANKMASK(DACCON1), 0
#define DAC1R1                           BANKMASK(DACCON1), 1
#define DAC1R2                           BANKMASK(DACCON1), 2
#define DAC1R3                           BANKMASK(DACCON1), 3
#define DAC1R4                           BANKMASK(DACCON1), 4
#define DACMD                            BANKMASK(PMD2), 6
#define DC                               BANKMASK(STATUS), 1
#define DC_SHAD                          BANKMASK(STATUS_SHAD), 1
#define DOE                              BANKMASK(CPUDOZE), 4
#define DOZE0                            BANKMASK(CPUDOZE), 0
#define DOZE1                            BANKMASK(CPUDOZE), 1
#define DOZE2                            BANKMASK(CPUDOZE), 2
#define DOZEN                            BANKMASK(CPUDOZE), 6
#define DSMMD                            BANKMASK(PMD5), 0
#define EXTOEN                           BANKMASK(OSCEN), 7
#define EXTOR                            BANKMASK(OSCSTAT1), 7
#define FERR                             BANKMASK(RC1STA), 2
#define FREE                             BANKMASK(NVMCON1), 4
#define FVREN                            BANKMASK(FVRCON), 7
#define FVRMD                            BANKMASK(PMD0), 6
#define FVRRDY                           BANKMASK(FVRCON), 6
#define G1EN                             BANKMASK(CWG1CON0), 7
#define G2EN                             BANKMASK(CWG2CON0), 7
#define GIE                              BANKMASK(INTCON), 7
#define GO                               BANKMASK(ADCON0), 1
#define GO_nDONE                         BANKMASK(ADCON0), 1
#define HFFRQ0                           BANKMASK(OSCFRQ), 0
#define HFFRQ1                           BANKMASK(OSCFRQ), 1
#define HFFRQ2                           BANKMASK(OSCFRQ), 2
#define HFFRQ3                           BANKMASK(OSCFRQ), 3
#define HFOEN                            BANKMASK(OSCEN), 6
#define HFOR                             BANKMASK(OSCSTAT1), 6
#define HFTUN0                           BANKMASK(OSCTUNE), 0
#define HFTUN1                           BANKMASK(OSCTUNE), 1
#define HFTUN2                           BANKMASK(OSCTUNE), 2
#define HFTUN3                           BANKMASK(OSCTUNE), 3
#define HFTUN4                           BANKMASK(OSCTUNE), 4
#define HFTUN5                           BANKMASK(OSCTUNE), 5
#define IDLEN                            BANKMASK(CPUDOZE), 7
#define INLVLA0                          BANKMASK(INLVLA), 0
#define INLVLA1                          BANKMASK(INLVLA), 1
#define INLVLA2                          BANKMASK(INLVLA), 2
